docs/examples/Close Transaction/SmartPost Close request.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/close/v5">
   <SOAP-ENV:Body>
      <SmartPostCloseRequest>
         <WebAuthenticationDetail>
          <ParentCredential>
               <Key>Input Your Information</Key>
               <Password>Input Your Information</Password>
            </ParentCredential>
            <UserCredential>
               <Key>Input Your Information</Key>
               <Password>Input Your Information</Password>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber>Input Your Information</AccountNumber>
            <MeterNumber>Input Your Information</MeterNumber>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId>TC_01_Smartpost_CLOSE</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>clos</ServiceId>
            <Major>5</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <HubId>5531</HubId>
         <DestinationCountryCode>US</DestinationCountryCode>
         <PickUpCarrier>FXSP</PickUpCarrier>
      </SmartPostCloseRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>